app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('G', 'R', 'PG-13', 'PG') ORDER BY release_date ASC
---
  def index
    @all_ratings = Movie.all_ratings
    #when to clear the session? after redirect?
    #how to connect an instance variable to a class vairable?
    if params[:ratings]
      #this is not working
      #accessing the ratings hash rails created out of the tag buttons
      Movie.selected= params[:ratings].keys

INSERT INTO "movies" ("created_at", "description", "rating", "release_date", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
  def create
    print params[:movie]
    @movie = Movie.create!(params[:movie])